export interface Project {
  id: number;
  title: string;
  description: string;
  images: string[];
  location: string;
  registrationUrl: string;
  feedbackUrl: string;
  rating: number; // от 1 до 5
  status: "completed" | "in-progress" | "planned";
  participants: number;
  tags: string[];
  date: string;
}

export const Projects: Project[] = [
  {
    id: 101,
    title: "LAUGH&SHARM",
    description: `Завдяки Laugh & SHARM ми вкотре переконалися: щоб бути лідером, потрібно вміти посміятися над собою і щиро розділити радість із другом. Даний захід - це середовище, де кожен спробував себе в ролі коміка або просто посміявся від душі. Дякуємо всім, хто не побоявся мікрофона і хто «заряджав» зал своїми аплодисментами. Це було гучно, яскраво і, без сумніву, незабутньо.`,
    images: ["laugh_main.png", "laugh_scene.png", "laugh_disko.png", "laugh_sponsor.png"],
    location: "Mezzanine, вул. Нижньоюрківська, 31, Київ",
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["стендап", "гумор", "дискотека", "лотерея", "імпровізація", "шарм"],
    date: "2025-08-29"
  },
  {
    id: 102,
    title: "Шармополія",
    description: `ШАРМОПОЛІЯ – інтерактивна гра за мотивами «Монополії». Це не просто розвага, а можливість навчитися командній роботі, проявити лідерські навички, перевірити фінансову грамотність та креативність. Особливість гри в тому, що поле та всі елементи були не настільними – учасники самі ставали «фішками» й рухалися по ігровому простору. «Шармополія» об’єднує учнівську молодь, дарує нові знайомства й заряд енергії для майбутніх звершень.`,
    images: ["sharmpolia_cool.png", "sharmopolia_golovadima.png", "sharmo_kudick.png", "sharmopolia_zoloto.png"],
    location: "м. Київ, КНУ економічний факультет",
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["гра", "монополія", "шарм", "настільна гра"],
    date: "2025-05-01"
  },
  {
    id: 103,
    title: "Клуб Дилетантів",
    description: `Клуб Дилетантів – це гра, де команда,яка була найближча до правильної відповіді стає переможцем, а той, хто відповів неправильно отримує веселі покарання! захід для тих, хто не боїться бути «не експертом». Тут можна плутати факти, вигадувати на ходу та все одно отримувати оплески. Це гра для сміливих, креативних і тих, хто хоче довести: бути дилетантом – теж круто!`,
    images: ['club_main.png', 'club_1.png', 'club_2.png'], 
    location: "м. Київ, вул. Жилянська, 97",
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "completed",
    participants: 5,
    tags: ["гра", "УЛК", "Клуб Дилетантів", "свято"],
    date: "2025-04-27"
  },
  {
    id: 104,
    title: "ПЛАСТхШАРМ",
    description: `Лідери ШАРМу ніколи не зупиняються на досягнутому, і цього разу наша жага до нових знань переросла у тісну та натхненну співпрацю з ПЛАСТом. Наше учнівське самоврядування організувало захід, що об’єднав сучасний активізм та багатовікові традиції українського скаутингу. Ми опанували такі навички, як: мистецтво вузлів, тактична підготовка та також розвинули командний дух.`,
    images: ["plast_1.png", "plast_2.png"],
    location: "м. Київ",
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "completed",
    participants: 0,
    tags: ["ПЛАСТ", "майстер-класи", "вузли", "джгут", "ватара", "партнерство", "шарм"],
    date: "2024-09-15"
  },
  {
    id: 105,
    title: "ВКУМ",
    description: `Шевченківська Активна Районна Молодь вкотре доводить, що єднання – наша суперсила! 28.09 відбулась Всеукраїнська Конференція Учнівської Молоді Київ-Львів, яку організував ШАРМ спільно з РРС «Лідер» та Учнівським Парламентом Львову. Львівські лідери прибули до Києва на один день, але за цей короткий проміжок часу вони не тільки встигли полюбуватись Києвом та послухати цікаву екскурсію, а й прийняти участь у дебатах у Київській Міській Державній Адміністрації – КМДА і, найголовніше, вони просочились атмосферою столиці!`,
    images: ["shaloma_1.png", "shaloma_2.png", "shalona_3.png"],
    location: "м. Київ, КМДА",
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "completed",
    participants: 0,
    tags: ["конференція", "Київ-Львів", "дебати", "екскурсія", "КМДА", "партнерство", "шарм"],
    date: "2024-09-28"
  },
    {
    id: 106,
    title: "Charmed&Haunted",
    description: `Навчання, дедлайни, стрес… все це так знайомо учням, саме тому ми організували розважальний захід Charmed&Haunted, який дав дітям можливість розвіятись, створити атмосферу єдності та святкування через ігрову форму. І також відсвяткувати Геловін у стилі Día de los Muertos з елементами театру, гри та ритуалів.`,
    images: ["CH1.PNG", "CH2.PNG", "CH3.PNG"],
    location: '',
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["стендап", "гумор", "дискотека", "лотерея", "імпровізація", "шарм"],
    date: "2025-08-29"
  },
      {
    id: 107,
    title: "Cookies for Forces",
    description: `У час, коли всі прагнуть допомогти українським воїнам чим можуть, наша команда не стоїть осторонь. Захід “Cookies for Forces” не тільки став благодійною ініціативою, а й справжнім обʼєднанням зусиль учнів, батьків та вчителів, так званим «лідерським трикутником». Все вироблене печиво було передане тим, хто потребує підтримки найбільше - військовим.`,
    images: ["KF1.PNG", "KF2.PNG", "KF3.PNG"],
    location: '',
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["стендап", "гумор", "дискотека", "лотерея", "імпровізація", "шарм"],
    date: "2025-08-29"
  },
      {
    id: 108,
    title: "Grow Together",
    description: `Певно, всі стикались із вигораннями. Але не всі знають, як з ними зправлятися. Саме тому наш захід “Grow Together” був таким корисним для учнівської молоді Києва. Лідери навчились підтримувати свою команду, дізнались, що допомагає команді бути згуртованими та як йти до мети разом.`,
    images: ["GT1.PNG", "GT2.PNG"],
    location: '',
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["стендап", "гумор", "дискотека", "лотерея", "імпровізація", "шарм"],
    date: "2025-08-29"
  },
    {
    id: 109,
    title: "ВКУМ 2.0",
    description: `Обʼєднання молоді та налагодження звʼязків - ключ до успішної держави. Саме це було метою Всеукраїнської Конференції Учнівської Молоді: YOUTHCONNECT Україна. 
Завдяки конференції лідери київських та львівських самоврядувань змогли налагодити контакти, поділитись досвідом, а також зробити фундамент для майбутніх змін.
Учнівський Парламент Львову прибув до Києва, після чого була проведена екскурсія по чарівній столиці України, а далі лідери відправились до Київської Міської Державної Адміністрації, де відбувалась остновна частина програми. Інтерактиви, дискусії та навіть інтервʼю - все це було рушієм змін.`,
    images: ["VK3.JPG", "VK2.png", "VK5.jpg", "VK6.jpg"],
    location: '',
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["стендап", "гумор", "дискотека", "лотерея", "імпровізація", "шарм"],
    date: "2025-08-29"
  },
  {
    id: 110,
    title: "Різдвяні традиції",
    description: `Українські традиції - це те, що допомагає не втратити звʼязок між поколіннями. А хто ж як не Шевченківська Активна Районна Молодь буде робити свій внесок у їх збереження?
13 грудня був проведений захід «Різдвяні традиції», який став не тільки пізнавальним, але й практичним: ми разом відкривали для себе сенси традицій, обговорювали їхню актуальність у сучасному світі та ділилися власними ідеями щодо збереження культурної спадщини.
Кожен крок, кожне наше старання над цим проєктом було спрямоване на те, щоб українські традиції залишалися живими та доступними для всіх.`,
    images: ["RT1.png", "RT2.png", "RT3.png"],
    location: '',
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["стендап", "гумор", "дискотека", "лотерея", "імпровізація", "шарм"],
    date: "2025-08-29"
  },
    {
    id: 111,
    title: "Кадетський бал",
    description: `Кадетський бал - це не просто танці, це відродження культури шляхетності в сучасному світі. Ми поєднуємо класичний етикет із молодіжною енергією, створюючи простір, де кожен жест має значення. Цей захід щорічний, а отже кожного року, декілька десятків юних молодиків та молодиць поєднують свої серця у ніжному вальсі ✨`,
    images: ["CB1.png", "CB2.png", "CB3.JPG"],
    location: '',
    registrationUrl: "",
    feedbackUrl: "",
    rating: 0,
    status: "planned",
    participants: 0,
    tags: ["стендап", "гумор", "дискотека", "лотерея", "імпровізація", "шарм"],
    date: "2025-08-29"
  },
];

export const allProjects = [...Projects, ...Projects];
